Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: ཐུབ་པའི་དབང་པོའི་སྐུ་མཆོག་དྲི་མ་མེད། །ཞིང་རྣམས་མཐའ་ཡས་ཐམས་ཅད་རབ་ཏུ་སྣང་། །
en: The stainless, supreme body of the lord of munis Illuminates all of the infinite realms.

source: སངས་རྒྱས་འོད་ནི་རྣམ་པར་ལྷང་ངེ་བས། །ཞིང་རྣམས་མཐའ་ཡས་བརྒྱ་སྟོང་རྣམས་སུ་ཡང་། །མཚན་བྱད་ཟླ་བ་ཉི་མ་མང་པོ་དག །དེ་དག་ཐམས་ཅད་འོད་ནི་མེད་པར་གྱུར། །
en: “ ‘A multitude of night-bringing moons and suns, In endless hundreds of thousands of realms, All become eclipsed by The brilliant light of the Buddha.

source: སངས་རྒྱས་ཉི་མ་འཇིག་རྟེན་སྒྲོན་མ་སྟེ། །སངས་རྒྱས་ཉི་མ་བརྒྱ་ཕྲག་སྟོང་རྣམས་ནི། །ཞིང་རྣམས་མཐའ་ཡས་སྟོང་ཕྲག་བརྒྱ་དག་ན། །དེ་བཞིན་གཤེགས་པའི་ཉི་མ་སེམས་ཅན་མཐོང་། །
en: “ ‘In endless hundreds of thousands of realms, May beings see the tathāgata suns— The suns of the buddhas, the lamps of worlds— As a hundred thousand buddha suns.

source: བསོད་ནམས་སྟོང་ཕྲག་བརྒྱ་དང་ལྡན་པའི་སྐུ། །
en: “ ‘His body is endowed with a hundred thousand merits.

source: ཡོན་ཏན་ཀུན་གྱིས་རབ་ཏུ་བརྒྱན་པའི་སྐུ། །
en: His body is adorned by all good qualities.

source: གླང་ཆེན་དབང་པོའི་སྣ་འདྲ་རྒྱལ་བའི་ཕྱག །
en: The Jina’s arms are like the trunk of the king of elephants.

source: ཕྱག་དང་ཞབས་འོད་རབ་མཛེས་དྲི་མ་མེད། །ས་ཡི་སྟེང་གི་རྡུལ་དང་མཚུངས་འདྲ་སྙེད། །ཕྲ་བའི་རྡུལ་སྙེད་སངས་རྒྱས་གང་འདས་དང་། །གང་དག་ཕྲ་བའི་རྡུལ་སྙེད་བྱུང་བ་དང་། །
en: His hands and feet are beautiful with stainless light.

source: གང་དག་ཕྲ་བའི་རྡུལ་སྙེད་བཞུགས་པ་ཡི། །རྒྱལ་བ་དེ་དག་ལ་ནི་རབ་དང་བའི། །ངག་ཡིད་ལུས་ཀྱིས་མེ་ཏོག་དབུལ་བ་དང་། །སྤོས་རྣམས་དབུལ་དང་བསྔགས་པ་བརྒྱ་དག་དང་། །དགེ་བའི་སེམས་ཀྱིས་ཀྱང་ནི་ཕྱག་འཚལ་ལོ། །
en: “ ‘The buddhas who have been, who are as numerous as atoms; Who are as numerous as the dust on the surface of the earth; Those who are appearing, who are as numerous as atoms; Those who are present, who are as numerous as atoms— “ ‘To those jinas I pay homage In pure faith, with body and speech, Offering flowers and offering perfumes, And with a hundred praises and a virtuous mind.

source: རྒྱལ་བའི་ཡོན་ཏན་གང་དག་དགེར་གྱུར་པ། །སྙིང་པོ་མཆོག་རབ་སྣ་ཚོགས་དུ་མ་སྟེ། །
en: “ ‘The good qualities that the jinas have Are a manifold multitude of the very best.

source: བདག་གིས་བསྐལ་པ་སྟོང་དུ་ལྕེ་བརྒྱ་ཡིས། །སངས་རྒྱས་ཡོན་ཏན་བརྗོད་པར་མི་ནུས་སོ། །
en: I could not describe those qualities of the jinas In a thousand eons with a hundred tongues.

source: རྒྱལ་བ་གཅིག་གི་ཡོན་ཏན་རྣམས་ཀྱང་ནི། །ལྕེ་སྟོང་གིས་ཀྱང་ཅུང་ཟད་བརྗོད་མི་ནུས། །བདག་གིས་རྒྱལ་བ་དག་ནི་ཐམས་ཅད་ཀྱི། །ཡོན་ཏན་ལྕེ་བརྒྱས་བརྗོད་པར་ག་ལ་ནུས། །
en: “ ‘With a thousand tongues I could not describe Even a fraction of the qualities of a single jina, So how could I describe with a thousand tongues The qualities of all the jinas?

source: ལྷར་བཅས་འཇིག་རྟེན་ཐམས་ཅད་མཚོར་གྱུར་ཏེ། །སྲིད་པའི་རྩེ་མོ་མན་ཆད་ཆུས་གང་བ། །སྐྲ་ཡི་རྩེ་མོས་དཔག་པར་ནུས་སྲིད་ཀྱི། །
en: “ ‘If the world and its paradises became an ocean, And up to the summit of existence became filled with water, It would be possible to measure it with the tip of a hair.

source: བདེ་གཤེགས་རྣམས་ཀྱི་ཡོན་ཏན་གཅིག་ལ་མིན། །
en: But one cannot measure a single quality of the sugatas.

source: ལུས་དང་ངག་ཡིད་རབ་ཏུ་དང་བ་ཡིས། །རྒྱལ་བ་ཀུན་ལ་བདག་གིས་བསྔགས་བསྟོད་པས། །
en: “ ‘With faith and with body, speech, and mind I praise and eulogize all the jinas.

source: བདག་གིས་བསོད་ནམས་འབྲས་བུ་མཆོག་བསགས་གང་། །དེས་ནི་སེམས་ཅན་རྒྱལ་བ་རེག་གྱུར་ཅིག །
en: Through my accumulated perfect results of merit, May beings reach the state of buddhahood.’

source: དེ་ལྟར་རྒྱལ་པོས་སངས་རྒྱས་རྣམས་བསྟོད་ནས། །རྒྱལ་པོ་འདི་ལྟར་སྨོན་ལམ་འདེབས་པ་ནི། །མ་འོངས་བསྐལ་པ་མཐའ་ཡས་རྣམས་སུ་ཡང་། །གང་དང་གང་དུ་བདག་ནི་སྐྱེ་བ་ན། །རྨི་ལམ་དུ་ནི་འདི་འདྲའི་རྔ་བལྟ་ཞིང་། །
en: “When the king had praised the Buddha in that way, The king prayed in this way: ‘Wherever I am born, In endless future eons, “ ‘May I see such a drum in a dream.

source: དེར་ནི་བཤགས་པ་འདི་འདྲ་མཉན་པར་བགྱི། །
en: There, may I hear this kind of confession.

source: རྒྱལ་བསྟོད་པདྨ་འབྱུང་རྒྱལ་འདི་འདྲ་བ། །སྐྱེ་བ་དེ་དང་དེར་ནི་རྙེད་པར་བགྱི། །
en: May I encounter in every lifetime A praise such as this Source of Lotuses.

source: སངས་རྒྱས་ཡོན་ཏན་མཐའ་ཡས་མཚུངས་མེད་དང་། །གང་ཡང་བསྐལ་པ་སྟོང་དུ་རྙེད་དཀའ་བ། །དེ་དག་རྨི་ལམ་དུ་ཡང་མཉན་པར་བགྱི། །ཉིན་གྱུར་ཚེ་ཡང་དེ་དག་བཤད་པར་བགྱི། །
en: “ ‘May I hear in a dream of those Infinite, unequaled qualities of the buddhas, Which are difficult to acquire even in a thousand eons, And may I teach them when I am awake.

source: སེམས་ཅན་སྡུག་བསྔལ་མཚོ་ལས་ཐར་བར་བགྱི། །
en: “ ‘May I free beings from the ocean of suffering.

source: ཕ་རོལ་ཕྱིན་པ་དྲུག་པོ་རྫོགས་པར་བགྱི། །ཕྱི་ནས་བྱང་ཆུབ་བླ་མེད་ཐོབ་པར་བགྱི། །བདག་གི་ཞིང་ནི་ལྷོད་པ་མེད་གྱུར་ཅིག །
en: May I complete the six perfections And afterward attain the highest enlightenment, And may my realm be without an equal.

source: རྔ་ཕུལ་རྣམ་པར་སྨིན་པའི་འབྲས་བུ་དང་། །རྒྱལ་བ་ཐམས་ཅད་ལ་ཡང་བསྟོད་པའི་རྒྱུས། །ཤཱཀྱ་ཐུབ་དབང་མངོན་དུ་བལྟ་བར་བགྱི། །དེར་ནི་བདག་གིས་ལུང་བསྟན་ཐོབ་གྱུར་ཅིག །
en: “ ‘Through the ripened result of offering a drum, And through the cause that is praising the buddhas, May I directly see the Śākya lord of munis, And may I attain there the prophecy of my buddhahood.

source: གསེར་གྱི་ལག་པའི་དབང་དང་གསེར་གྱི་འོད། །བདག་གི་ཁྱེའུ་ནི་གང་ཡིན་འདི་གཉིས་ཀྱང་། །དེར་ནི་བུ་ཕོ་དེ་དག་གཉི་ག་དང་། །བྱང་ཆུབ་བླ་མེད་ལུང་བསྟན་ཐོབ་པར་ཤོག །
en: “ ‘May these two youths, my two sons, Kanaka­bhujendra and Kanaka­prabhāsvara, Attain there the prophecy Of attaining the highest enlightenment.

source: སེམས་ཅན་གང་དག་གནས་དང་རྟེན་མེད་ཅིང་། །སྐྱབས་དང་བྲལ་ནས་ཕོངས་པར་གྱུར་པ་དག །དེ་དག་ལ་ཡང་མ་འོངས་དུས་རྣམས་ན། །སྐྱོབ་དང་དཔུང་གཉེན་སྐྱབས་དང་རྟེན་གྱུར་ཤོག །
en: “ ‘May those beings who have no protector or savior, Who are without a refuge and are in distress, May they all in the future Have saviors, protectors, and refuges.

source: སྡུག་བསྔལ་ཀུན་འབྱུང་ཟད་པར་བྱེད་གྱུར་ཅིག །
en: “ ‘May the source of all suffering come to an end.

source: དགེ་བ་ཀུན་གྱི་འབྱུང་གནས་གྱུར་པར་ཤོག །
en: May there be the source of all happiness.

source: སྔོན་མཐའ་འདས་པ་དེ་དག་ཇི་སྲིད་པ། །མ་འོངས་བསྐལ་པར་བྱང་ཆུབ་སྤྱད་པར་བགྱི། །
en: May I have the conduct of enlightenment in future eons, Which are as numerous as the eons of the past.

source: གསེར་འོད་དམ་པ་ཡི་ནི་བཤགས་པ་ཡིས། །བདག་གི་སྡིག་པའི་རྒྱ་མཚོ་བསྐམས་པར་ཤོག །བདག་གི་ལས་ཀྱི་རྒྱ་མཚོ་ཟད་གྱུར་ཅིག །
en: “ ‘Through the confession of The Sublime Golden Light, May my ocean of bad actions dry up, May my ocean of karma come to an end, And may my ocean of kleśas cease to exist.

source: བདག་གི་ཉོན་མོངས་རྒྱ་མཚོ་ཟད་པར་ཤོག །བདག་གི་བསོད་ནམས་རྒྱ་མཚོ་རྫོགས་གྱུར་ཅིག །
en: “ ‘May my ocean of merit become complete.

source: ཡེ་ཤེས་དྲི་མེད་སྣང་བ་དམ་པ་ཡི། །བདག་གི་ཡེ་ཤེས་རྒྱ་མཚོ་རྣམ་དག་ཅིང་། །ཡོན་ཏན་ཀུན་གྱི་རྒྱ་མཚོར་གྱུར་པར་ཤོག །
en: Through the power of the light of stainless wisdom, May the ocean of my wisdom become complete, And may there be an ocean of all qualities.

source: བྱང་ཆུབ་ཡོན་ཏན་རིན་ཆེན་རྫོགས་གྱུར་ཅིག །
en: “ ‘May the precious qualities of enlightenment be complete.

source: གསེར་འོད་དམ་པའི་བཤགས་པའི་སྟོབས་ཀྱིས་ནི། །
en: Through the power of The Sublime Golden Light confession.

source: བདག་གི་བསོད་ནམས་རབ་ཏུ་སྣང་བར་ཤོག །
en: May my merit become radiant.

source: བདག་གི་བྱང་ཆུབ་སྣང་བ་རྣམ་དག་གྱུར། །
en: May the light of my enlightenment be purified.

source: ཡེ་ཤེས་དྲི་མེད་སྣང་བ་དམ་པ་ཡི། །བདག་གི་ལུས་ཀྱི་འོད་ནི་སྣང་བར་ཤོག །
en: “ ‘Through the sublime light of stainless wisdom, May my body shine with light.

source: བསོད་ནམས་སྣང་བ་ལྷག་གེར་བྱ་བའི་ཕྱིར། །འཇིག་རྟེན་གསུམ་ན་ཁྱད་པར་འཕགས་གྱུར་ཅིག །
en: In order that the light of merit be bright, May I become preeminent within the three worlds.

source: བསོད་ནམས་སྟོབས་དང་རྟག་ཏུ་ལྡན་པར་ཤོག །
en: “ ‘May I always have the power of merit.

source: སྡུག་བསྔལ་རྒྱ་མཚོ་ལས་ནི་སྒྲོལ་བ་དང་། །བདེ་བ་ཀུན་གྱི་རྒྱ་མཚོ་འདྲ་བ་ཡིས། །མ་འོངས་བསྐལ་པར་བྱང་ཆུབ་སྤྱད་པར་བགྱི། །
en: May I be liberated from the ocean of suffering And practice enlightened conduct in future eons With every happiness that is like an ocean.

source: འཇིག་རྟེན་གསུམ་ན་སྔོན་མཐར་ཇི་སྙེད་གཤེགས། །དེ་དག་ཞིང་ནི་རྒྱལ་བ་ཐམས་ཅད་ཀྱི། །ཡོན་ཏན་མཐའ་ཡས་ཁྱད་འཕགས་ཅི་འདྲ་བ། །ཡོན་ཏན་མཐའ་ཡས་རྣམས་ཀྱིས་བདག་གི་ཞིང་། །མ་འོངས་དུས་ན་དེ་འདྲར་འགྱུར་བར་ཤོག །
en: “ ‘In future times, may my realm Have the same infinite qualities As the superior, infinite qualities Of all the jinas in the realms That have been in the three worlds in the past.’ ”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། འདས་པ་དང་མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བསྟོད་པ་མེ་ཏོག་པདྨའི་འབྱུང་གནས་ཀྱི་ལེའུ་ཞེས་བྱ་བ་སྟེ་ལྔ་པའོ།། །།
en: This concludes “The Source of Lotus Flowers: A Praise of All the Buddhas,” the fifth chapter of “The Lord King of Sūtras, The Sublime Golden Light.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །བསམ་གྱིས་མི་ཁྱབ་མདོ་རྣམས་གཞན་དག་ཏུ། །སྟོང་པའི་ཆོས་རྣམས་རབ་ཏུ་རྒྱས་བཤད་དེ། །
en: Chapter 6: Emptiness Then the Bhagavat recited these verses: “I have taught the Dharmas of emptiness Very extensively in countless other sūtras.

source: དེ་ལྟ་བས་ན་མདོ་མཆོག་དམ་པ་འདིར། །སྟོང་པའི་ཆོས་རྣམས་མདོ་ཙམ་བཤད་པ་ཡིན། །
en: Therefore, in this supreme sūtra I will teach the Dharmas of emptiness briefly.

source: སེམས་ཅན་བློ་ཆུང་རྣམ་པར་མི་ཤེས་པས། །ཆོས་རྣམས་ཐམས་ཅད་ཤེས་པར་མི་ནུས་ཏེ། །
en: “Unknowing beings with little intelligence Are not able to know all the Dharmas.

source: དེ་ལྟ་བས་ན་མདོ་མཆོག་དམ་པ་འདིར། །སྟོང་པའི་ཆོས་རྣམས་མདོ་ཙམ་རབ་ཏུ་བཤད། །
en: Therefore, in this supreme sūtra I will teach the Dharmas of emptiness briefly.

source: སེམས་ཅན་ཀུན་གྱིས་ཅི་ནས་ཤེས་འགྱུར་དང་། །སེམས་ཅན་འབྱུང་བྱའི་ཕྱིར་ནི་སྙིང་རྗེའི་དབང་། །ཐབས་དང་ཚུལ་དང་རྒྱུ་གཞན་རྣམས་ཀྱིས་ནི། །མདོ་མཆོག་དམ་པ་དབང་པོ་འདི་བཤད་དོ། །
en: “I teach this lord of supreme sūtras Through other methods, ways, and causes, And through compassion, so that all beings will understand And so that it will arise in beings.

source: ལུས་འདི་གྲོང་ཁྱིམ་སྟོང་པ་ཇི་བཞིན་ཏེ། །དབང་པོ་རྣམས་ནི་དམག་དང་ཆོམ་རྐུན་འདྲ། །
en: “This body is like an empty village.

source: དེ་དག་ཐམས་ཅད་གྲོང་གཅིག་གནས་མོད་ཀྱི། །དེ་དག་ཕན་ཚུན་རྣམ་པར་མི་ཤེས་སོ། །
en: The senses are like six village thieves, Who, although they are in the same village, Are not aware of one another.

source: མིག་གི་དབང་པོ་གཟུགས་གྱུར་རྣམས་ལ་རྒྱུག །རྣ་བའི་དབང་པོ་སྒྲ་ལ་རྣམ་པར་སྤྱོད། །སྣ་ཡི་དབང་པོ་སྣ་ཚོགས་དྲི་རྣམས་འཕྲོག །ལྕེ་ཡི་དབང་པོ་རྟག་ཏུ་རོ་ལ་རྒྱུག །ལུས་ཀྱི་དབང་པོ་རེག་པ་དག་ལ་རྒྱུག །
en: “The sense of sight runs toward forms; The sense of hearing moves after sounds; The sense of smell steals various aromas; The sense of taste runs after flavors; “The sense of touch pursues tactility; The mental sense investigates phenomena.

source: ཡིད་ཀྱི་དབང་པོ་ཆོས་རྣམས་རྣམ་པར་སྤྱོད། །དབང་པོ་དྲུག་པོ་འདི་དག་ཕན་ཚུན་དུ། །རང་རང་ཡུལ་ལ་རབ་ཏུ་འཇུག་པར་བྱེད། །
en: These six senses in relation to one another Are each engaging with their own objects of perception.

source: སེམས་ནི་སྒྱུ་མ་ལྟ་བུར་གཡོ་བ་ཡིན། །
en: “The mind is unstable, like an illusion.

source: དབང་པོ་དྲུག་ནི་ཡུལ་ལ་རྣམ་སྤྱོད་དེ། །
en: The six senses experience their fields of perception.

source: ཇི་ལྟར་མི་ཞིག་གྲོང་སྟོང་རྒྱུག་པ་དང་། །དམག་དང་ཆོམ་རྐུན་དག་དང་གནས་པ་བཞིན། །ཇི་ལྟར་སེམས་ནི་ཡུལ་དྲུག་གནས་བཅས་ཤིང་། །དབང་པོའི་སྤྱོད་ཡུལ་དག་ཀྱང་རབ་ཤེས་པ། །
en: The six village thieves present there, Are like a man running around in an empty village.

source: དེ་ལྟར་སེམས་ནི་ཡུལ་དྲུག་གནས་བཅས་ཏེ། །དབང་པོའི་སྤྱོད་ཡུལ་རྣམས་ཀྱང་རབ་ཏུ་ཤེས། །གཟུགས་དང་སྒྲ་དང་དེ་བཞིན་དྲི་རྣམས་དང་། །རོ་དང་རེག་བྱ་དེ་བཞིན་སྤྱོད་ཡུལ་ཆོས། །སེམས་ནི་དབང་པོ་དྲུག་པོ་ཐམས་ཅད་ལ། །དབང་པོར་བཞུགས་པ་བྱ་བཞིན་གཡོ་བར་འགྱུར། །
en: “Just as the mind and the six present senses Know the range of sensory perception— Forms, sounds, and likewise smells, Flavors, tactility, and the range of mental phenomena— “The mind enters the senses, moving like a bird Throughout all six of them.

source: དབང་པོ་གང་དང་གང་དུ་གནས་བཅས་པ། །དབང་པོ་དེ་ནི་ཤེས་པར་བདག་ཉིད་བྱེད། །
en: In whatever sense it is present, It has the nature of that sense’s perception.

source: ལུས་ནི་གཡོ་བ་མེད་ཅིང་བྱེད་པ་མེད། །
en: “The body is unmoving and has no activity.

source: སྙིང་པོ་མེད་ཅིང་རྐྱེན་ལས་བྱུང་བ་ཡིན། །
en: It has no essence and arises from conditions.

source: ཡང་དག་མ་ཡིན་ཡོངས་སུ་རྟོག་ལས་བྱུང་། །
en: It has no real existence but arises from concepts.

source: གྲོང་སྟོང་ལས་ཀྱི་འཁྲུལ་འཁོར་འདྲ་བར་གནས། །
en: It is an empty village; it is like a working machine.

source: ས་དང་མེ་དང་ཆུ་དང་རླུང་རྣམས་ནི། །གཞན་དུ་གནས་ཏེ་ཕྱོགས་དང་ཕྱོགས་ན་གནས། །
en: “Earth, fire, water, and air Dwell here and there outside the village.

source: དཔེར་ན་སྦྲུལ་གདུག་གནས་གཅིག་ཇི་བཞིན་ཏེ། །རྟག་ཏུ་ཕན་ཚུན་མཐུན་པ་མ་ཡིན་བཞིན། །
en: They are like poisonous snakes in one location That are always in conflict with one another.

source: ཁམས་ཀྱི་སྦྲུལ་རྣམས་བཞི་པོ་དེ་དག་ཀྱང་། །གཉིས་ནི་སྟེང་འགྲོ་གཉིས་ནི་ཐུར་དུ་འགྲོ། །ཕྱོགས་དང་ཕྱོགས་མཚམས་རྣམས་སུ་གཉིས་གཉིས་ཏེ། །ཁམས་སྦྲུལ་དེ་དག་ཐམས་ཅད་འཇིག་པར་འགྱུར། །
en: “Of those four snakes of the elements, Two move upward and two go downward; They go in twos to the main and intermediate directions, And all those element snakes are destroyed.

source: ས་ཡི་སྦྲུལ་དང་ཆུ་ཡི་སྦྲུལ་དག་དང་། །འདི་གཉིས་འོག་ཏུ་ཟད་པར་འགྱུར་བ་ཡིན། །
en: “The earth snake and the water snake— These two come to an end below.

source: མེ་ཡི་སྦྲུལ་དང་རླུང་གི་སྦྲུལ་དག་དང་། །འདི་གཉིས་སྟེང་གི་ནམ་མཁར་འགྲོ་བ་ཡིན། །
en: The fire snake and the air snake— They go upward into the sky.

source: ཇི་ལྟར་སྔོན་ཆད་བྱས་པའི་ལས་རྣམས་ཀྱིས། །སེམས་དང་རྣམ་ཤེས་ཀུན་ཏུ་གནས་ནས་དོང་། །
en: “The mind and the consciousnesses remain, And they go according to previous karma.

source: ལྷ་དང་མི་དང་ངན་སོང་གསུམ་དག་ཏུ། །ཇི་ལྟར་བྱས་པའི་ལས་ཀྱིས་སྲིད་པར་སྐྱེ། །
en: According to the karma created in the past, they are reborn Into an existence among devas, humans, or the three lower realms.

source: བད་ཀན་རླུང་དང་མཁྲིས་པ་ཟད་གྱུར་ན། །ལུས་ནི་གཅིན་དང་ངན་སྐྱུགས་རྣམས་ཀྱིས་གང་། །
en: “When the phlegm, air, and bile come to an end, The body becomes covered with urine and vomit.

source: མངོན་པར་མི་དགའ་སྲིན་བུའི་ཕུང་པོར་གྱུར། །དུར་ཁྲོད་དག་ན་འཐོར་བ་ཤིང་བཞིན་གྱུར། །
en: It becomes a disgusting mass of worms And is cast into the charnel ground as if it were wood.

source: ལྷ་མོ་ཁྱོད་ནི་ཆོས་འདི་རྣམས་ལ་ལྟོས། །འདི་ལ་སེམས་ཅན་དེ་བཞིན་གང་ཟག་དང་། །ཆོས་རྣམས་འདི་དག་ཐམས་ཅད་སྟོང་པ་སྟེ། །མ་རིག་པ་ཡི་རྐྱེན་ལས་བྱུང་བ་ཡིན། །
en: “Goddess, look at these phenomena, At whatever being or individual is here; All of these phenomena are empty, But they occur through the factor of ignorance.

source: འབྱུང་བ་ཆེན་པོ་འདི་དག་ཆེ་འབྱུང་མིན། །
en: “All these great elements are not ‘great occurrences.’

source: མ་བྱུང་བ་ལས་བྱུང་ཞིང་མི་འབྱུང་སྟེ། །གང་གི་ཕྱིར་ནི་འབྱུང་བ་མི་འབྱུང་བ། །
en: They occur through nonoccurrence and so do not occur.

source: དེ་ཕྱིར་འབྱུང་བ་ཆེ་ཞེས་ངས་བརྗོད་དོ། །
en: Because the occurring elements are nonoccurring, For that reason I call them ‘great elements.’

source: ཡོད་པ་མིན་ཞིང་གཞར་ཡང་ཡོད་མིན་ལ། །
en: “They are not existent and never were existent.

source: མ་རིག་པ་ཡི་རྐྱེན་ལས་བྱུང་བ་ཡིན། །
en: They come to be because of ignorance.

source: མ་རིག་འདི་ནི་ཡོད་པ་མ་ཡིན་ཏེ། །
en: This ignorance, too, is not existent.

source: དེ་བས་ངས་ནི་མ་རིག་འདི་བཤད་དོ། །
en: Therefore, I teach that this is ignorance.

source: འདུ་བྱེད་རྣམ་ཤེས་མིང་དང་གཟུགས་བཅས་དང་། །སྐྱེ་མཆེད་དྲུག་དང་རེག་དང་ཚོར་བ་དང་། །སྲེད་དང་ལེན་དང་དེ་བཞིན་སྲིད་པ་དང་། །སྐྱེ་དང་རྒ་ཤི་མྱ་ངན་གནོད་པ་རྣམས། །འཁོར་བའི་སྡུག་བསྔལ་བསམ་གྱིས་མི་ཁྱབ་པ། །
en: “Formations, consciousness, and name and form; The six āyatanas, contact, and sensation; Craving, grasping, and likewise becoming; And the misfortunes of birth, aging and death, and misery— “Those inconceivable sufferings in saṃsāra That are present in the wheel of saṃsāra Have happened without happening and have no origination.

source: འཁོར་བའི་འཁོར་ལོ་ཇི་ལྟར་གནས་པ་དག །མ་བྱུང་བ་ལས་བྱུང་དང་མི་འབྱུང་དང་། །ཚུལ་བཞིན་མ་ཡིན་སེམས་ཀྱིས་རྣམ་དཔྱད་དང་། །བདག་གི་ལྟ་བར་གྱུར་པར་བཅད་པར་གྱིས། །
en: The distinctions made by an erroneous mind, “And the view that there is a self, should be cut through.

source: ཡེ་ཤེས་རལ་གྲིས་ཉོན་མོངས་རྒྱ་མོ་གྲོལ། །
en: Cut through the net of the kleśas with the sword of wisdom.

source: ཕུང་པོའི་གནས་ལ་སྟོང་པར་གྱུར་པར་ལྟོས། །
en: See that the basis of the skandhas is empty.

source: བྱང་ཆུབ་ཡོན་ཏན་རྒྱ་ཆེན་རེག་པར་གྱིས། །
en: Reach the vast qualities of the buddhas.

source: ངས་ནི་བདུད་རྩི་གྲོང་ཁྱེར་སྒོ་ཡང་ཕྱེ། །
en: “I have opened the gate of the city of amṛta.

source: བདུད་རྩི་ཁུ་བའི་སྣོད་ཀྱང་ཀུན་ཏུ་བསྟན། །
en: I have shown everyone the vessel of amṛta liquid.

source: ང་ནི་བདུད་རྩིའི་གྲོང་ཁྱེར་གནས་དེར་འཇུག །ངས་ནི་བདུད་རྩིའི་ཁུ་བས་བདག་ཚིམ་བྱས། །
en: I have entered the place that is the city of amṛta, And I have been satiated by the amṛta liquid.

source: ངས་ནི་ཆོས་ཀྱི་རྔ་ཆེན་དམ་པ་བརྡུངས། །
en: “I have beaten the sublime great drum of the Dharma.

source: ངས་ནི་ཆོས་ཀྱི་དུང་གི་མཆོག་ཀྱང་བུས། །
en: I have blown the sublime conch of the Dharma.

source: ངས་ནི་ཆོས་ཀྱི་སྒྲོན་མ་མཆོག་འབར་བྱས། །ངས་ནི་ཆོས་ཀྱི་ཆར་པ་དམ་པ་ཕབ། །
en: I have lit the sublime lamp of the Dharma, And I have sent down a sublime rain of Dharma.

source: ང་ནི་ཉོན་མོངས་དགྲ་མཆོག་རྣམས་ལས་རྒྱལ། །
en: “I have defeated the supreme enemy, the kleśas.

source: ངས་ནི་ཆོས་ཀྱི་རྒྱལ་མཚན་དམ་པ་བསྒྲེང་། །
en: I have raised the sublime banner of the Dharma.

source: སྲིད་པའི་མཚོ་ལས་སེམས་ཅན་རབ་ཏུ་བསྒྲལ། །
en: I have brought beings across the ocean of existence.

source: ངས་ནི་ངན་སོང་གསུམ་གྱི་ལམ་རྣམས་བཀག །
en: I have blocked the road to the three lower existences.

source: སེམས་ཅན་ཉོན་མོངས་མེ་ཡིས་གདུངས་གྱུར་པ། །རྟེན་མེད་གྱུར་ཅིང་དཔུང་གཉེན་མེད་པ་དག །
en: “There are beings who are tormented by the fire of the kleśas, Who have no support or protector.

source: སྲོག་ཆགས་ཉོན་མོངས་མེས་གདུངས་ཞི་བྱས་ནས། །བདུད་རྩིའི་ཁུ་བ་བསིལ་བས་ཚིམ་པར་བྱས། །
en: I have extinguished the fire of the kleśas in those beings And brought them relief with the cooling liquid of amṛta.

source: གང་ཕྱིར་བསྐལ་པ་དུ་མར་སྔོན་ཆད་ངས། །འདྲེན་པ་བསམ་གྱིས་མི་ཁྱབ་མཆོད་པ་བྱས། །ཆོས་ཀྱི་སྐུ་དེ་ཡོངས་སུ་ཚོལ་བ་ན། །བརྟུལ་ཞུགས་བརྟན་པས་བྱང་ཆུབ་ཕྱིར་སྤྱད་དེ། །
en: “For that reason, through many past eons I made offerings to innumerable guides, And in seeking for the Dharma body I practiced resolute discipline for the sake of enlightenment.

source: ལག་པ་དང་ནི་མིག་དང་རྐང་པ་དང་། །ཡན་ལག་མཆོག་དང་བུ་སྡུག་བུ་མོ་དང་། །ནོར་དབྱིག་ནོར་བུ་མུ་ཏིག་རྒྱན་དང་གསེར། །བཻ་ཌཱུརྱ་དང་རིན་ཆེན་སྣ་ཚོགས་བཏང་། །སྟོང་གསུམ་ཤིང་ལྗོན་ཐམས་ཅད་དང་། །རྩྭ་དང་རྩྭ་རྣམས་ཐམས་ཅད་དང་། །
en: “I gave away my arms, eyes, and legs; My head, beloved sons and daughters, Wealth, treasures, ornamentations of jewels and pearls, Gold, beryl, and various kinds of jewels.

source: ནགས་ཚལ་དག་དང་ས་ལས་ནི། །སྐྱེ་བ་ཐམས་ཅད་བཅད་གཏུབས་ཏེ། །དེ་དག་ཐམས་ཅད་ཕྱེར་བརླག་ནས། །རབ་ཏུ་ཕྲ་བའི་རྡུལ་འདྲར་བྱས། །ནམ་མཁའི་དཀྱིལ་འཁོར་ཇི་ཙམ་པར། །ཕྱེ་མའི་ཕུང་པོ་སྤུངས་ནས་ནི། །འདི་ལ་ཆ་གསུམ་དབྱེ་བར་ནུས། །
en: “If all the trees in the trichiliocosm, And all the grasses, the plants, And the forests—everything that Grows from the ground—were to be cut down, “And they were all ground down And made into the smallest atoms And were formed into a heap of powder That reached the domain of the sky, “It would not be possible to divide that into portions.

source: ས་ལ་རྡུལ་ནི་ཡོད་པ་རྣམས། །སྟོང་གསུམ་དག་ནི་ཐམས་ཅད་ཀྱི། །རྡུལ་ཁམས་བསམ་གྱིས་མི་ཁྱབ་པ། །སེམས་ཅན་ཀུན་གྱི་ཤེས་པ་གང་། །དེ་ནི་སེམས་ཅན་གཅིག་གིར་གྱུར། །ཤེས་པ་དེ་ཡིས་རྡུལ་རྣམས་ཀྱི། །ཕྱེ་མ་བགྲང་བར་བྱེད་ན་ནི། །སེམས་ཅན་ཀུན་ལས་རབ་འཕགས་པ། །ཡེ་ཤེས་རབ་ལྡན་མི་རྣམས་ཀྱིས། །ཐམས་ཅད་བགྲང་བར་ནུས་སྲིད་ཀྱི། །
en: There are the particles that exist in the earth— The countless elemental particles In all the trichiliocosm worlds— “And if the knowledge of all beings Could become that of a single being, Such that with that knowledge All those particles could be counted, “Then the humans with that perfect wisdom, Who would be superior to all other beings, Could possibly count all those particles, But still they would not be able to calculate a jina’s wisdom.

source: རྒྱལ་བའི་མཁྱེན་ལ་མི་ནུས་སོ། །ཐུབ་པ་ཆེན་པོའི་ཡེ་ཤེས་གང་། །སྐད་ཅིག་གཅིག་ལ་འཇུག་པ་ཡང་། །བསྐལ་པ་བྱེ་བ་དུ་མར་ནི། །གང་དུའང་བགྲང་བར་མི་ནུས་སོ། །
en: “If they were to engage with a single instant Of the wisdom of the great Muni, For many millions of eons, They would still be unable to calculate it.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། སྟོང་པ་ཉིད་ཀྱི་ལེའུ་ཞེས་བྱ་བ་སྟེ་དྲུག་པའོ།། །།དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་དང་། རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་དང་། རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་དང་། རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་རྣམས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གསུངས་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གཟིགས་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དགོངས་པ།
en: This concludes “Emptiness,” the sixth chapter of “The Lord King of Sūtras, The Sublime Golden Light.”

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བཟུང་བ། ལྷའི་ཚོགས་ཐམས་ཅད་ཀྱིས་ཕྱག་བགྱིས་པ། ལྷའི་ཚོགས་ཐམས་ཅད་ཀྱིས་མཆོད་པ། ལྷའི་དབང་པོའི་ཚོགས་ཐམས་ཅད་ཀྱིས་མངོན་པར་བསྟོད་པ། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་ཀྱིས་མཆོད་ཅིང་བསྔགས་པ་བརྗོད་ནས་རབ་ཏུ་བཀུར་བ། ལྷའི་ཁང་ཁྱིམ་ཐམས་ཅད་སྣང་བར་བགྱིད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་མཆོག་ཏུ་བདེ་བ་རབ་ཏུ་སྦྱིན་པར་བགྱིད་པ། སེམས་ཅན་དམྱལ་བ་དང་དུད་འགྲོའི་སྐྱེ་གནས་དང་གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་སྐེམས་པ། འཇིགས་པ་ཐམས་ཅད་ཀྱི་རྒྱུན་གཅོད་པ། ཕ་རོལ་གྱི་དམག་ཚོགས་ཐམས་ཅད་རབ་ཏུ་བཟློག་པ། མུ་གེའི་དགོན་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ། ནད་ཀྱི་དགོན་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ། གཟའ་ཐམས་ཅད་སེལ་བ། མཆོག་ཏུ་ཞི་བར་བགྱིད་པ། མྱ་ངན་དང་ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བར་བགྱིད་པ། གནོད་པ་རྣམ་པ་སྣ་ཚོགས་རབ་ཏུ་ཞི་བར་བགྱིད་པ། གནོད་པ་བརྒྱ་སྟོང་རབ་ཏུ་འཇོམས་པར་བགྱིད་པ་ལགས་སོ། །
en: Chapter 7: The Four Mahārājas Then Mahārāja Vaiśravaṇa, Mahārāja Dhṛtarāṣṭra, Mahārāja Virūḍhaka, and Mahārāja Virūpākṣa rose from their seats, and with their upper robe over one shoulder, knelt on their right knee and, with palms together in homage, bowed toward the Bhagavat and said, “Venerable Bhagavat, this Lord King of Sūtras, The Sublime Golden Light, is taught by all the tathāgatas; it is viewed by all the tathāgatas; it is thought of by all the tathāgatas; it is possessed by all the assemblies of bodhisattvas; it is paid homage to by all the hosts of devas; it is offered to by all the hosts of devas; it is praised by all the hosts of the lords of devas; it is offered to, praised, and honored by all the protectors of the world; it illuminates all the divine mansions; it brings supreme happiness to all beings; it extinguishes all the suffering in the hells, in the lives of animals, and in the realm of Yama; it brings fears to an end; it repels all the armies of enemies; it brings the calamity of famines to an end; it brings the calamity of disease to an end; it dispels all planetary influences; it brings perfect peace; it ends misery and troubles; and it brings to an end various kinds of calamities—it overcomes a hundred thousand calamities.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཁོར་གྱི་ནང་དུ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བཤད་ན། ཆོས་ཉན་པ་ཆོས་བདུད་རྩིའི་ཁུ་བ་འདིས། བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་བཞི་ལྷའི་ལུས་འདི་གཟི་བརྗིད་ཆེན་པོས་རྣམ་པར་འཕེལ་བར་འགྱུར་རོ། །བདག་ཅག་གི་ལུས་ལ་བརྩོན་པ་དང་སྟོབས་དང་མཐུ་ཡང་སྐྱེད་པར་འགྱུར། གཟི་བརྗིད་དང་དཔལ་དང་ཕུན་སུམ་ཚོགས་པ་ཡང་དེ་དག་གི་ལུས་ལ་འཇུག་པར་འགྱུར་རོ། །
en: “Venerable Bhagavat, if you extensively elucidate this Lord King of Sūtras, The Sublime Golden Light, through hearing the Dharma, through the liquid of the amṛta of the Dharma, then the divine bodies of we Four Mahārājas and our armies and attendants will increase in their great magnificence; diligence, strength, and power will arise in our bodies; and magnificence, splendor, and good fortune will enter our bodies.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་ནི་ཆོས་དང་ལྡན་པ་ཆོས་སྨྲ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ལགས་ཏེ།
en: “Venerable Bhagavat, we Four Mahārājas possess the Dharma, teach the Dharma, and are Dharma kings.
